tests/artillery.txt
Phase started: unnamed (index: 0, duration: 1s) 11:26:41(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 11:26:42(-0300)

--------------------------------------
Metrics for period to: 11:26:50(-0300) (width: 1.009s)
--------------------------------------

http.codes.200: ................................................................ 2500
http.request_rate: ............................................................. 2493/sec
http.requests: ................................................................. 2500
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 14
  median: ...................................................................... 1
  p95: ......................................................................... 4
  p99: ......................................................................... 7
http.responses: ................................................................ 2500
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 20.7
  max: ......................................................................... 165.3
  median: ...................................................................... 70.1
  p95: ......................................................................... 144
  p99: ......................................................................... 162.4


All VUs finished. Total time: 3 seconds

--------------------------------
Summary report @ 11:26:44(-0300)
--------------------------------

http.codes.200: ................................................................ 2500
http.request_rate: ............................................................. 2493/sec
http.requests: ................................................................. 2500
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 14
  median: ...................................................................... 1
  p95: ......................................................................... 4
  p99: ......................................................................... 7
http.responses: ................................................................ 2500
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 20.7
  max: ......................................................................... 165.3
  median: ...................................................................... 70.1
  p95: ......................................................................... 144
  p99: ......................................................................... 162.4